doctormord/ESP32-Wifi-Bridge-on-Steroids/src/bridge.cpp
/*
 * bridge.cpp
 *
 * Datenpfad der Wi-Fi <-> Ethernet-Bridge plus Management-IP-Stack.
 *
 * Der Kniff steckt in wifi_rx_cb(): esp_wifi_internal_reg_rxcb() hat nur
 * EINEN Slot, und den belegt normalerweise lwIP. Wir nehmen ihn uns, machen
 * aber die Tuersteher-Arbeit selbst und reichen genau die Frames an lwIP
 * weiter, die an die Management-IP adressiert sind. Alles andere geht direkt
 * und ohne Umweg ueber den IP-Stack aufs Ethernet.
 */

#include "bridge.h"
#include "driver/gpio.h"
#include "config.h"

#include <string.h>
#include <stdlib.h>

#include "esp_attr.h"
#include "esp_err.h"
#include "esp_event.h"
#include "esp_eth_mac.h"
#include "esp_eth_phy.h"
#include "esp_mac.h"
#include "esp_system.h"
#include "esp_wifi.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

/* Fuer die Standorterkennung per Gateway-Ping (siehe gateway_erreichbar). */
#include "ping/ping_sock.h"

#if defined(__has_include)
#  if __has_include("esp_private/esp_wifi_internal.h")
#    include "esp_private/esp_wifi_internal.h"
#    define BRIDGE_HAVE_WIFI_INTERNAL_HDR 1
#  elif __has_include("esp_wifi_internal.h")
#    include "esp_wifi_internal.h"
#    define BRIDGE_HAVE_WIFI_INTERNAL_HDR 1
#  endif
#endif

#ifndef BRIDGE_HAVE_WIFI_INTERNAL_HDR
extern "C" {
typedef esp_err_t (*wifi_rxcb_t)(void *buffer, uint16_t len, void *eb);
esp_err_t esp_wifi_internal_reg_rxcb(wifi_interface_t ifx, wifi_rxcb_t fn);
esp_err_t esp_wifi_internal_tx(wifi_interface_t ifx, void *buffer, uint16_t len);
void      esp_wifi_internal_free_rx_buffer(void *buffer);
}
#endif

/* eth_rx_cb() reicht Management-Frames per esp_netif_receive() an lwIP weiter
 * und gibt den Puffer danach sofort frei. Das ist NUR zulaessig, solange
 * wlanif_input() die Nutzdaten kopiert statt sie zu referenzieren - genau das
 * schaltet CONFIG_LWIP_L2_TO_L3_COPY. Ohne die Option waere es ein
 * Use-after-free, der sich als sporadische Abstuerze unter Last zeigen wuerde
 * und kaum auffindbar waere. Deshalb hier hart abbrechen statt hoffen. */
#ifndef CONFIG_LWIP_L2_TO_L3_COPY
#error "CONFIG_LWIP_L2_TO_L3_COPY muss gesetzt sein - siehe eth_rx_cb() in bridge.cpp"
#endif

/* --- WT32-ETH01 Pinbelegung ---------------------------------------------- */
#define ETH_PHY_ADDR        1
#define ETH_PHY_MDC_GPIO    23
#define ETH_PHY_MDIO_GPIO   18
#define ETH_PHY_PWR_GPIO    16

/*
 * Sendewiederholungen, bevor ein Frame verworfen wird.
 *
 * ACHTUNG: Der richtige Wert haengt vom VERKEHR ab, nicht vom Geraet.
 *
 *   TCP (Speedtest, Dateiuebertragung)
 *       Schnelles Verwerfen ist besser. TCP sendet selbst nach und drosselt;
 *       Warten blockiert nur den Ethernet-Empfang. Gemessen 2026-08-13:
 *       Retries 1 lieferte 12,0/4,8 Mbit, Retries 8 nur 10,4/4,0.
 *
 *   UDP (Kamera, RTP)
 *       Genau umgekehrt. Ein verworfenes Paket ist ENDGUELTIG weg und wird
 *       zum Bildfehler. Gemessen 2026-08-15 an einer Kamera mit 2 Mbit:
 *       Retries  1 -> 13,29 % Verlust
 *       Retries  8 ->  0,93 %
 *       Retries 16 ->  0,10 %
 *
 * Der Standard steht auf 8, weil das der Einsatzzweck dieses Geraets ist:
 * eine Kamera bruecken, nicht Speedtests gewinnen. Ich hatte hier zunaechst
 * 1 stehen und das ausfuehrlich mit Speedtest-Zahlen begruendet - das war
 * eine Optimierung auf den Benchmark statt auf die Anwendung.
 *
 * Nach oben ist es nicht gratis: Jede Wiederholung haelt den emac_rx-Task
 * laenger auf, und was in dieser Zeit hereinkommt, verliert der Ethernet-DMA,
 * ohne dass unsere Zaehler es sehen. Deshalb der kleinste Wert, der das Ziel
 * erreicht - genau danach sucht auch das Autotune im Portal.
 */
#define ETH_TX_RETRIES_DEF  8
/* Gegenrichtung: Ethernet nimmt praktisch immer an, drop_down ist in allen
 * Messungen 0 geblieben. Hier gibt es nichts zu gewinnen. */
#define WIFI_TX_RETRIES_DEF 1
#define WIFI_CONNECT_TIMEOUT_MS 12000

/* Die Retry-Zaehler liegen als eigene Variablen und nicht als g_cfg-Zugriff
 * im Datenpfad: eth_rx_cb/wifi_rx_cb laufen im IRAM und werden pro Paket
 * aufgerufen, da soll kein Umweg ueber die grosse Config-Struktur hinein.
 * volatile, weil das Portal sie aus einem anderen Task heraus aendert. */
static volatile uint8_t s_eth_tx_retries  = ETH_TX_RETRIES_DEF;
static volatile uint8_t s_wifi_tx_retries = WIFI_TX_RETRIES_DEF;

/* --- Zustand -------------------------------------------------------------- */
static esp_eth_handle_t s_eth        = NULL;
static esp_netif_t     *s_mgmt_netif = NULL;

static volatile bool s_eth_link      = false;
static volatile bool s_wifi_up       = false;
static volatile bool s_active        = false;
static volatile bool s_paused        = false;   /* waehrend OTA */

static uint8_t       s_client_mac[6] = {0};
static volatile bool s_mac_known     = false;

/* Management-IP als Bytes - so kann im Datenpfad direkt memcmp() laufen,
 * ohne Byte-Order-Gefummel. */
static uint8_t       s_mgmt_ip[4]    = {0};

/* IP des gebridgten Clients, im Datenpfad mitgelesen. Die Bridge arbeitet auf
 * Layer 2 und braucht diese Adresse nicht - sie ist reine Diagnose. Ohne sie
 * sieht man im Portal nur die MAC und weiss nicht, ob der Client ueberhaupt
 * eine Adresse hat, geschweige denn welche. Genau das war am 2026-08-14 beim
 * Anschluss der Kamera die offene Frage. */
static volatile uint8_t s_client_ip[4] = {0};

/* Hostname des Clients, aus seiner DHCP-Anfrage mitgelesen (Option 12).
 * Router benennen Geraete genau daraus. Steht hier nichts, sendet der Client
 * auch keinen - dann liegt es nicht am Router. Genau diese Frage war am
 * 2026-08-14 offen: die Kamera heisst laut Konfiguration "PB4", taucht im
 * AR-300 aber als "unknown" auf. */
static char s_client_name[32] = "";

static volatile uint32_t s_pkt_e2w = 0, s_pkt_w2e = 0;
static volatile uint32_t s_drop_e2w = 0, s_drop_w2e = 0;
static volatile uint64_t s_by_e2w = 0, s_by_w2e = 0;
static uint32_t s_kbps_e2w = 0, s_kbps_w2e = 0;

/* Fuer den Watchdog (siehe unten) und zur Diagnose im Portal: wie oft die
 * STA seit dem Boot die Assoziation verloren hat. Reine Reassoziierungs-
 * Haeufigkeit sagt etwas, das die Drop-Zaehler allein nicht zeigen - naemlich
 * ob der Funkkanal die Verbindung selbst wegreisst, nicht nur einzelne
 * Frames verliert. */
static volatile uint32_t s_wifi_disc_count = 0;

