doctormord/ESP32-Wifi-Bridge-on-Steroids/src/bridge.cpp
static char s_bssid_str[18] = "-";

/* Sendeleistung, die die PHY nach dem Start von sich aus einstellt.
 * Wird beim ersten bridge_apply_live_tuning() gemerkt, damit ein
 * zurueckgesetztes tx_power (=0) sie WIEDERHERSTELLEN kann. Ohne das blieb
 * der zuletzt gesetzte Wert stehen, und "Standard" im Portal war wirkungslos -
 * am 2026-08-15 beim Durchmessen der Sendeleistung aufgefallen. */
static int8_t s_txp_default = 0;

/* Was beim letzten esp_wifi_init() wirklich gesetzt wurde. */
static uint8_t s_eff_static_rx = CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM;
static uint8_t s_eff_dyn_rx    = CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM;
static uint8_t s_eff_dyn_tx    = CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM;
static uint8_t s_eff_ba_win    = CONFIG_ESP_WIFI_RX_BA_WIN;

static void mac2str(const uint8_t *m, char *out) {
  sprintf(out, "%02x:%02x:%02x:%02x:%02x:%02x", m[0], m[1], m[2], m[3], m[4], m[5]);
}

/* ===========================================================================
 * Datenpfad
 * ========================================================================= */

/* Definition steht weiter unten beim Wi-Fi->Ethernet-Pfad, wird aber schon
 * hier gebraucht: beide Richtungen benutzen dieselbe Tuersteher-Pruefung. */
IRAM_ATTR static inline bool is_for_mgmt(const uint8_t *f, uint16_t len);

/*
 * Ethernet -> Wi-Fi. Laeuft im emac_rx-Task, 'buffer' gehoert uns.
 *
 * WICHTIG: Dieser Pfad darf NICHT blockieren. Standardmaessig gibt es genau
 * einen Sendeversuch; klappt der nicht, ist das Frame weg. Das wirkt falsch,
 * ist aber messbar richtig - die Begruendung steht bei ETH_TX_RETRIES_DEF.
 * Kurz: Warten haelt den Ethernet-Empfang an, und was in der Zeit hereinkommt,
 * verliert der DMA in Bursts. Das schadet TCP mehr, als der eingesparte
 * Einzelverlust nuetzt.
 */
IRAM_ATTR static esp_err_t eth_rx_cb(esp_eth_handle_t h, uint8_t *buffer,
                                     uint32_t len, void *priv) {
  (void)h; (void)priv;

  if (s_paused) { free(buffer); return ESP_OK; }   /* stillgelegt, kein Drop */

  /* Client-IP mitlesen. Hier ist der Absender immer der angeschlossene Client,
   * die Quelladresse also seine. Kostet zwei Vergleiche und vier Byte kopieren.
   * 0.0.0.0 wird verworfen - so sieht eine DHCP-Anfrage aus, bevor der Client
   * eine Adresse hat, und die waere als Anzeige irrefuehrend. */
  if (len >= 34) {
    const uint16_t et = ((uint16_t)buffer[12] << 8) | buffer[13];
    const uint8_t *src = NULL;
    if      (et == 0x0800)               src = buffer + 26;  /* IPv4-Quelle   */
    else if (et == 0x0806 && len >= 42)  src = buffer + 28;  /* ARP-Absender  */
    if (src && (src[0] | src[1] | src[2] | src[3])) {
      s_client_ip[0]=src[0]; s_client_ip[1]=src[1];
      s_client_ip[2]=src[2]; s_client_ip[3]=src[3];
    }
  }

  /* DHCP-Hostnamen mitlesen - nur solange wir noch keinen haben, damit der
   * heisse Pfad danach unbelastet bleibt. Strenge Laengenpruefungen, weil hier
   * ungeprueft Fremddaten geparst werden. */
  if (!s_client_name[0] && len >= 42 &&
      ((uint16_t)buffer[12] << 8 | buffer[13]) == 0x0800 && buffer[23] == 17) {
    const uint32_t ihl = (uint32_t)(buffer[14] & 0x0F) * 4;
    const uint32_t udp = 14 + ihl;
    if (ihl >= 20 && len >= udp + 8) {
      const uint16_t sp = (uint16_t)buffer[udp] << 8 | buffer[udp + 1];
      const uint16_t dp = (uint16_t)buffer[udp + 2] << 8 | buffer[udp + 3];
      if (sp == 68 && dp == 67) {                 /* Client -> DHCP-Server */
        uint32_t o = udp + 8 + 240;               /* fester BOOTP-Kopf + Magic */
        while (o + 1 < len) {
          const uint8_t t = buffer[o];
          if (t == 255) break;                    /* Ende der Optionen */
          if (t == 0)   { o++; continue; }        /* Fuellbyte */
          const uint8_t l = buffer[o + 1];
          if (o + 2 + l > len) break;
          if (t == 12 && l) {                     /* Option 12 = Hostname */
            const uint8_t n = l < sizeof(s_client_name) - 1
                              ? l : sizeof(s_client_name) - 1;
            memcpy(s_client_name, buffer + o + 2, n);
            s_client_name[n] = '\0';
            break;
          }
          o += 2 + l;
        }
      }
    }
  }

  /* Frames an die Management-IP gehoeren dem lokalen Stack, nicht ins WLAN.
   * Ohne diese Abzweigung ist die Weboberflaeche von der Client-Seite aus
   * unerreichbar - schon der ARP-Request nach der Management-IP wandert
   * hinaus ins WLAN und wird nie beantwortet. (Auf echter Hardware am
   * 2026-08-13 genau so beobachtet: Bridge lief, Oberflaeche vom
   * angeschlossenen Laptop aus tot.)
   *
   * Zur Sicherheit der Pufferuebergabe: esp_netif_receive() ist hier nur
   * deshalb erlaubt, weil CONFIG_LWIP_L2_TO_L3_COPY gesetzt ist. Dann
   * kopiert wlanif_input() die Nutzdaten in einen eigenen pbuf; ohne die
   * Option wuerde es unseren Puffer bloss referenzieren (PBUF_REF), den wir
   * eine Zeile spaeter freigeben -> Use-after-free im heissen Pfad.
   * NULL als l2_buff ist zulaessig, wifi_free() prueft darauf. */
#ifndef BRIDGE_MINIMAL
  if (len >= 14 && is_for_mgmt(buffer, (uint16_t)len)) {
    esp_netif_receive(s_mgmt_netif, buffer, len, NULL);
    free(buffer);
    return ESP_OK;
  }
#endif

  esp_err_t err = ESP_FAIL;
  if (s_active && s_wifi_up) {
    const uint8_t retries = s_eth_tx_retries;
    for (int i = 0; i < retries; i++) {
      err = esp_wifi_internal_tx(WIFI_IF_STA, buffer, (uint16_t)len);
      if (err == ESP_OK || err != ESP_ERR_NO_MEM) break;

      /* Die ersten Versuche nur die CPU abgeben statt schlafen.
       *
       * vTaskDelay(1) wartet bei 1000 Hz Tick IMMER eine volle Millisekunde,
       * auch wenn der WLAN-Sendepuffer schon nach Mikrosekunden wieder frei
       * ist. Das blockiert den emac_rx-Task, und der Ethernet-DMA puffert nur
       * rund 2,4 ms (20 Puffer x 1522 Byte bei 100 Mbit) - laengere Blockaden
       * verliert man dort still, ohne dass unsere Drop-Zaehler es sehen.
       *
       * taskYIELD() gibt an den hoeher priorisierten WLAN-Task ab, der die
       * Puffer freiraeumt, und kehrt zurueck sobald der fertig ist. Erst
       * wenn das mehrfach nichts gebracht hat, ist echtes Warten sinnvoll -
       * dann ist die Funkstrecke wirklich dicht und Nachdruecken hilft nicht.
       * Am 2026-08-13 gemessen: mit reinem vTaskDelay(1) blieben 1,5 %
       * Verlust uebrig, die sich weder durch mehr Puffer noch durch HT40
       * druecken liessen. */
      if (i < 3) taskYIELD();
      else       vTaskDelay(1);
    }
  }

