doctormord/ESP32-Wifi-Bridge-on-Steroids/src/bridge.cpp
  if (err == ESP_OK) { s_pkt_e2w = s_pkt_e2w + 1; s_by_e2w += len; }
  else               { s_drop_e2w = s_drop_e2w + 1; }

  free(buffer);
  return ESP_OK;
}

/*
 * Gehoert dieses Frame dem Management-Stack?
 *
 *   - IPv4 mit Ziel == Management-IP
 *   - ARP-Request/Reply mit Target-IP == Management-IP
 *
 * Bewusst NICHT enthalten: Broadcast- und Multicast-IPv4. Die gehen
 * ausschliesslich zum Client durch. Dadurch faellt mDNS/SSDP fuer die
 * Management-Schnittstelle weg - bei fester IP verschmerzbar, und es haelt
 * den heissen Pfad frei von Sonderfaellen.
 */
IRAM_ATTR static inline bool is_for_mgmt(const uint8_t *f, uint16_t len) {
  if (!s_mgmt_netif) return false;

  const uint16_t ethertype = ((uint16_t)f[12] << 8) | f[13];

  if (ethertype == 0x0800) {                 /* IPv4  */
    if (len < 34) return false;
    return memcmp(f + 30, s_mgmt_ip, 4) == 0;   /* Ziel-IP  */
  }
  if (ethertype == 0x0806) {                 /* ARP   */
    if (len < 42) return false;
    return memcmp(f + 38, s_mgmt_ip, 4) == 0;   /* Target Protocol Address */
  }
  return false;
}

/*
 * Wi-Fi -> Ethernet bzw. -> lwIP.
 *
 * 'eb' ist der interne RX-Buffer und MUSS in jedem Pfad genau einmal
 * freigegeben werden. esp_netif_receive() uebernimmt ihn selbst - dort also
 * kein eigenes free().
 */
IRAM_ATTR static esp_err_t wifi_rx_cb(void *buffer, uint16_t len, void *eb) {
  uint8_t *f = (uint8_t *)buffer;

#ifndef BRIDGE_MINIMAL
  if (len >= 14 && is_for_mgmt(f, len)) {
    return esp_netif_receive(s_mgmt_netif, buffer, len, eb);
  }
#endif

  if (s_paused) {
    if (eb) esp_wifi_internal_free_rx_buffer(eb);
    return ESP_OK;
  }

  esp_err_t err = ESP_FAIL;
  if (s_active && s_eth_link && s_eth) {
    const uint8_t retries = s_wifi_tx_retries;
    for (int i = 0; i < retries; i++) {
      err = esp_eth_transmit(s_eth, buffer, len);
      if (err == ESP_OK) break;
      vTaskDelay(1);
    }
  }

  if (err == ESP_OK) { s_pkt_w2e = s_pkt_w2e + 1; s_by_w2e += len; }
  else               { s_drop_w2e = s_drop_w2e + 1; }

  if (eb) esp_wifi_internal_free_rx_buffer(eb);
  return ESP_OK;
}

/* Nur waehrend der Sniff-Phase aktiv. */
static esp_err_t eth_sniff_cb(esp_eth_handle_t h, uint8_t *buffer,
                              uint32_t len, void *priv) {
  (void)h; (void)priv;
  if (!s_mac_known && len >= 12 && (buffer[6] & 0x01) == 0) {
    memcpy(s_client_mac, buffer + 6, 6);
    s_mac_known = true;
  }
  free(buffer);
  return ESP_OK;
}

/* ===========================================================================
 * Events
 * ========================================================================= */

static void eth_evt(void *arg, esp_event_base_t base, int32_t id, void *data) {
  (void)arg; (void)base; (void)data;
  if (id == ETHERNET_EVENT_CONNECTED) {
    s_eth_link = true;  printf("[ETH ] Link up\n");
  } else if (id == ETHERNET_EVENT_DISCONNECTED) {
    s_eth_link = false; printf("[ETH ] Link down\n");
  }
}

static void wifi_evt(void *arg, esp_event_base_t base, int32_t id, void *data) {
  (void)arg; (void)base;

  if (id == WIFI_EVENT_STA_CONNECTED) {
    s_wifi_up = true;
    wifi_event_sta_connected_t *e = (wifi_event_sta_connected_t *)data;
    if (e) mac2str(e->bssid, s_bssid_str);
    printf("[WIFI] Verbunden (AP %s)\n", s_bssid_str);

    /* WICHTIG: erst hier registrieren. esp_netif hat sich beim Attach
     * bereits eingetragen - dieser Aufruf ueberschreibt das gezielt, damit
     * wir die Tuersteher-Rolle bekommen. */
    esp_err_t e2 = esp_wifi_internal_reg_rxcb(WIFI_IF_STA, wifi_rx_cb);
    if (e2 != ESP_OK) {
      printf("[WIFI] reg_rxcb fehlgeschlagen: %s\n", esp_err_to_name(e2));
    }

  } else if (id == WIFI_EVENT_STA_DISCONNECTED) {
    s_wifi_up = false;
    strcpy(s_bssid_str, "-");
    s_wifi_disc_count = s_wifi_disc_count + 1;
    wifi_event_sta_disconnected_t *d = (wifi_event_sta_disconnected_t *)data;
    printf("[WIFI] Getrennt (reason %d)\n", d ? d->reason : -1);
    if (s_active) esp_wifi_connect();     /* im Betrieb dauerhaft nachfassen */
  }
}

/* ===========================================================================
 * Ethernet
 * ========================================================================= */

bool bridge_eth_init(void) {
  gpio_config_t pwr = {};
  pwr.pin_bit_mask = 1ULL << ETH_PHY_PWR_GPIO;
  pwr.mode         = GPIO_MODE_OUTPUT;
  gpio_config(&pwr);
  gpio_set_level((gpio_num_t)ETH_PHY_PWR_GPIO, 1);
  delay(200);   /* Oszillator einschwingen lassen */

  eth_mac_config_t mac_cfg = ETH_MAC_DEFAULT_CONFIG();
  mac_cfg.rx_task_stack_size = 4096;   /* unser Callback ruft in den WiFi-Stack */

  eth_esp32_emac_config_t emac = ETH_ESP32_EMAC_DEFAULT_CONFIG();
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
  emac.smi_gpio.mdc_num  = ETH_PHY_MDC_GPIO;
  emac.smi_gpio.mdio_num = ETH_PHY_MDIO_GPIO;
#else
  emac.smi_mdc_gpio_num  = ETH_PHY_MDC_GPIO;
  emac.smi_mdio_gpio_num = ETH_PHY_MDIO_GPIO;
#endif
  emac.clock_config.rmii.clock_mode = EMAC_CLK_EXT_IN;
  emac.clock_config.rmii.clock_gpio = EMAC_CLK_IN_GPIO;

  esp_eth_mac_t *mac = esp_eth_mac_new_esp32(&emac, &mac_cfg);
  if (!mac) { printf("[ETH ] MAC-Init fehlgeschlagen\n"); return false; }

  eth_phy_config_t phy_cfg = ETH_PHY_DEFAULT_CONFIG();
  phy_cfg.phy_addr       = ETH_PHY_ADDR;
  phy_cfg.reset_gpio_num = -1;

  esp_eth_phy_t *phy = esp_eth_phy_new_lan87xx(&phy_cfg);
  if (!phy) { printf("[ETH ] PHY-Init fehlgeschlagen\n"); return false; }

  esp_eth_config_t cfg = ETH_DEFAULT_CONFIG(mac, phy);
  esp_err_t err = esp_eth_driver_install(&cfg, &s_eth);
  if (err != ESP_OK) {
    printf("[ETH ] driver_install: %s\n", esp_err_to_name(err));
    return false;
  }

  esp_event_handler_instance_register(ETH_EVENT, ESP_EVENT_ANY_ID,
                                      &eth_evt, NULL, NULL);
  return true;
}

bool bridge_sniff_client_mac(uint32_t timeout_ms) {
  esp_eth_update_input_path(s_eth, eth_sniff_cb, NULL);
  if (esp_eth_start(s_eth) != ESP_OK) {
    printf("[ETH ] Start fehlgeschlagen\n");
    return false;
  }

  printf("[ETH ] Warte auf erstes Client-Frame...\n");
  const uint32_t t0 = millis();
  uint32_t last_log = t0;

  while (!s_mac_known) {
    if (timeout_ms && (millis() - t0) > timeout_ms) {
      printf("[ETH ] Timeout - kein Client erkannt\n");
      return false;
    }
    if (millis() - last_log > 5000) {
      last_log = millis();
      printf("[ETH ] ...noch nichts. Client angeschlossen?\n");
    }
    delay(20);
  }

