doctormord/ESP32-Wifi-Bridge-on-Steroids/src/bridge.cpp
  char s[18]; mac2str(s_client_mac, s);
  printf("[ETH ] Client-MAC: %s\n", s);

  esp_eth_update_input_path(s_eth, NULL, NULL);
  bool promisc = true;
  esp_eth_ioctl(s_eth, ETH_CMD_S_PROMISCUOUS, &promisc);
  printf("[ETH ] Promiscuous aktiv\n");
  return true;
}

/* ===========================================================================
 * Wi-Fi + Management-Netif
 * ========================================================================= */

/* Ist ein IPv4-Feld ueberhaupt belegt? 0.0.0.0 gilt durchgaengig als
 * "nicht gesetzt" - siehe Konvention in config.h. */
static inline bool ip_gesetzt(const uint8_t a[4]) {
  return (a[0] | a[1] | a[2] | a[3]) != 0;
}

/* ---------------------------------------------------------------------------
 * Standorterkennung per Gateway-Ping
 *
 * Die naheliegende Idee, das Profil am SSID-Slot festzumachen, traegt nicht:
 * an beiden Standorten kann dasselbe WLAN stehen (hier tatsaechlich der Fall,
 * beide heissen gleich). Dann verbindet immer Slot 1 und Profil 2 kaeme nie
 * zum Zug.
 *
 * Also fragen wir das Netz selbst: Profil setzen, dessen Gateway anpingen,
 * und bei Schweigen das andere Profil probieren. Das braucht keine
 * zusaetzliche Eingabe - das Gateway steht ohnehin in der Konfiguration -
 * und ueberlebt Router- oder Mesh-Wechsel, im Gegensatz zu einer fest
 * eingetragenen BSSID.
 * ------------------------------------------------------------------------ */

static volatile bool s_ping_antwort;

static void ping_ok_cb(esp_ping_handle_t hdl, void *args) {
  (void)hdl; (void)args;
  s_ping_antwort = true;
}

static bool gateway_erreichbar(const uint8_t gw[4], uint32_t gesamt_ms) {
  if (!ip_gesetzt(gw)) return false;

  s_ping_antwort = false;

  esp_ping_config_t cfg = ESP_PING_DEFAULT_CONFIG();
  cfg.count       = 4;
  cfg.interval_ms = 250;
  cfg.timeout_ms  = 400;
  cfg.data_size   = 8;      /* klein halten, wir wollen nur ein Lebenszeichen */
  /* ip_addr_t ist NICHT immer dieselbe Struktur: mit abgeschaltetem IPv6
   * (CONFIG_LWIP_IPV6=n, siehe sdkconfig.defaults) schrumpft lwIP den Typ auf
   * struct ip4_addr zusammen - dann gibt es weder .type noch die u_addr-Union.
   * Nicht verwechseln mit esp_netif_dns_info_t weiter unten, das ist
   * esp_ip_addr_t und behaelt die Union unabhaengig davon. */
#if LWIP_IPV6
  cfg.target_addr.type = IPADDR_TYPE_V4;
  memcpy(&cfg.target_addr.u_addr.ip4.addr, gw, 4);
#else
  memcpy(&cfg.target_addr.addr, gw, 4);
#endif

  esp_ping_callbacks_t cbs = {};
  cbs.on_ping_success = ping_ok_cb;

  esp_ping_handle_t h = NULL;
  if (esp_ping_new_session(&cfg, &cbs, &h) != ESP_OK) {
    /* Kein Ping moeglich -> nicht faelschlich "nicht erreichbar" melden,
     * sonst wechselt die Bridge wegen eines internen Fehlers das Profil. */
    printf("[WIFI] Ping-Session fehlgeschlagen - Profil bleibt\n");
    return true;
  }
  esp_ping_start(h);

  const uint32_t t0 = millis();
  while (!s_ping_antwort && (millis() - t0) < gesamt_ms) delay(50);

  esp_ping_stop(h);
  esp_ping_delete_session(h);
  return s_ping_antwort;
}

/*
 * Den IP-Satz des tatsaechlich verbundenen Netzes auf das Management-Netif
 * legen. idx 0 = erstes WLAN, idx 1 = zweites.
 *
 * Warum das nicht einmalig vor dem Verbindungsaufbau passiert: welches der
 * beiden WLANs erreichbar ist, weiss man erst hinterher. Genau daran ist der
 * Wechsel zwischen zwei Standorten bisher gescheitert - es gab nur einen
 * IP-Satz fuer beide.
 *
 * Faellt ein Feld des zweiten Profils leer aus, gilt dafuer der Wert des
 * ersten. Ein halb ausgefuelltes Profil soll das Board erreichbar lassen,
 * statt es mit Maske 0.0.0.0 ins Nichts zu konfigurieren.
 */
/* Zugriff auf die drei Profile ohne Sonderfaelle an jeder Verwendungsstelle. */
static const uint8_t *profil_ip(size_t i)   { return i==2 ? g_cfg.mgmt_ip3   : i==1 ? g_cfg.mgmt_ip2   : g_cfg.mgmt_ip;   }
static const uint8_t *profil_mask(size_t i) { return i==2 ? g_cfg.mgmt_mask3 : i==1 ? g_cfg.mgmt_mask2 : g_cfg.mgmt_mask; }
static const uint8_t *profil_gw(size_t i)   { return i==2 ? g_cfg.mgmt_gw3   : i==1 ? g_cfg.mgmt_gw2   : g_cfg.mgmt_gw;   }

/* Profil 1 gilt immer; 2 und 3 nur, wenn sie eine IP haben. */
static bool profil_belegt(size_t i) { return i == 0 || ip_gesetzt(profil_ip(i)); }

static void mgmt_apply_ip(size_t idx) {
  if (!profil_belegt(idx)) idx = 0;
  const uint8_t *ip4  = profil_ip(idx);
  const uint8_t *mask = profil_mask(idx);
  const uint8_t *gw   = profil_gw(idx);
  /* Einzelne leere Felder erben von Profil 1 - ein halb ausgefuelltes Profil
   * soll das Board erreichbar lassen, nicht mit Maske 0.0.0.0 ins Nichts. */
  if (!ip_gesetzt(mask)) mask = g_cfg.mgmt_mask;
  if (!ip_gesetzt(gw))   gw   = g_cfg.mgmt_gw;

  /* s_mgmt_ip ist die Kopie, gegen die is_for_mgmt() im Datenpfad
   * vergleicht - die MUSS mitgezogen werden, sonst zeigt das Netif auf die
   * neue Adresse, waehrend der Tuersteher noch die alte durchlaesst. */
  memcpy(s_mgmt_ip, ip4, 4);

  esp_netif_ip_info_t ip = {};
  memcpy(&ip.ip.addr,      ip4,  4);
  memcpy(&ip.netmask.addr, mask, 4);
  memcpy(&ip.gw.addr,      gw,   4);
  if (esp_netif_set_ip_info(s_mgmt_netif, &ip) != ESP_OK) {
    printf("[WIFI] Statische IP konnte nicht gesetzt werden\n");
  }

  esp_netif_dns_info_t dns = {};
  dns.ip.type = ESP_IPADDR_TYPE_V4;
  memcpy(&dns.ip.u_addr.ip4.addr, gw, 4);
  esp_netif_set_dns_info(s_mgmt_netif, ESP_NETIF_DNS_MAIN, &dns);

  printf("[WIFI] Profil %u: %u.%u.%u.%u / %u.%u.%u.%u  GW %u.%u.%u.%u\n",
         (unsigned)(idx + 1),
         ip4[0], ip4[1], ip4[2], ip4[3],
         mask[0], mask[1], mask[2], mask[3],
         gw[0], gw[1], gw[2], gw[3]);
}

#ifndef BRIDGE_MINIMAL
static void standort_bestimmen(size_t bevorzugt) {
  size_t reihe[3]; size_t n = 0;
  if (profil_belegt(bevorzugt)) reihe[n++] = bevorzugt;
  for (size_t k = 0; k < 3; k++)
    if (k != bevorzugt && profil_belegt(k)) reihe[n++] = k;
  if (!n) { mgmt_apply_ip(0); return; }

  /* Nur ein belegtes Profil - dann gibt es nichts zu entscheiden, und wir
   * sparen uns die Ping-Wartezeit beim Start. */
  if (n == 1) { mgmt_apply_ip(reihe[0]); return; }

