doctormord/ESP32-Wifi-Bridge-on-Steroids/src/bridge.cpp
  for (size_t j = 0; j < n; j++) {
    mgmt_apply_ip(reihe[j]);
    if (gateway_erreichbar(profil_gw(reihe[j]), 2500)) {
      printf("[WIFI] Gateway von Profil %u antwortet - Standort erkannt\n",
             (unsigned)(reihe[j] + 1));
      return;
    }
    printf("[WIFI] Profil %u antwortet nicht\n", (unsigned)(reihe[j] + 1));
  }
  /* Keins antwortet: auf das bevorzugte zurueck. Eine moeglicherweise
   * falsche, aber vorhersagbare Adresse ist besser als die zufaellig
   * zuletzt gesetzte. */
  printf("[WIFI] Kein Gateway antwortet - bleibe bei Profil %u\n",
         (unsigned)(reihe[0] + 1));
  mgmt_apply_ip(reihe[0]);
}
#endif

bool bridge_wifi_start(void) {
#ifdef BRIDGE_MINIMAL
  /* Messvariante: KEIN Management-Netif. Ohne s_mgmt_netif liefert
   * is_for_mgmt() sofort false, der Datenpfad reicht also alles ungeprueft
   * durch - genau wie das Rust-Original. Dient dem Nachweis, ob der
   * Management-Stack den Durchsatz kostet. */
  printf("[WIFI] MINIMAL-Variante: kein Management-Netif\n");
#else
  /* Netif anlegen und SOFORT auf statisch umstellen. Mit DHCP wuerde die
   * geklonte MAC dieselbe Adresse wie der Client bekommen - Kollision. */
  s_mgmt_netif = esp_netif_create_default_wifi_sta();
  if (!s_mgmt_netif) {
    printf("[WIFI] Netif-Erstellung fehlgeschlagen\n");
    return false;
  }
  esp_netif_dhcpc_stop(s_mgmt_netif);

  /* Vorlaeufig den ersten Satz setzen, damit das Netif nie ohne gueltige
   * Adresse dasteht. Nach erfolgreichem Verbindungsaufbau wird der Satz des
   * tatsaechlich verbundenen Netzes angewandt. */
  mgmt_apply_ip(0);
#endif

  /* WIFI_INIT_CONFIG_DEFAULT() uebernimmt static_rx_buf_num,
   * dynamic_rx_buf_num und dynamic_tx_buf_num bereits aus sdkconfig. Frueher
   * standen hier zusaetzlich feste Zahlen (16/32/32) - gemeint als doppelte
   * Absicherung, tatsaechlich haben sie die Kconfig-Werte ueberschrieben und
   * jede Erhoehung in sdkconfig.defaults wirkungslos gemacht. Deshalb raus:
   * die Puffergroessen stehen jetzt nur noch an einer Stelle. */
  wifi_init_config_t wcfg = WIFI_INIT_CONFIG_DEFAULT();
#if CONFIG_ESP_WIFI_AMPDU_TX_ENABLED
  wcfg.ampdu_tx_enable    = 1;
#endif
#if CONFIG_ESP_WIFI_AMPDU_RX_ENABLED
  wcfg.ampdu_rx_enable    = 1;
#endif
  /* tx_ba_win existiert in dieser IDF-/arduino-esp32-Version nicht mehr als
   * Feld in wifi_init_config_t - das TX-Block-Ack-Fenster wird hier beim
   * Verbindungsaufbau automatisch mit dem AP ausgehandelt und ist nicht
   * mehr separat vorkonfigurierbar. rx_ba_win existiert weiterhin.
   * Praktisch bedeutet das: die Kamera->WLAN-Richtung (Ethernet->WiFi, der
   * eigentliche Upload-Pfad der Kamera) haengt jetzt am AP-Verhalten statt
   * an unserer Vorgabe - meist kein Problem, aber falls der Durchsatz in
   * genau dieser Richtung schwaechelt, ist das der Punkt, an dem man
   * ansetzen muesste (z.B. ueber idf.py menuconfig mit reinem espidf-Build). */
#ifdef CONFIG_ESP_WIFI_RX_BA_WIN
  wcfg.rx_ba_win          = CONFIG_ESP_WIFI_RX_BA_WIN;
#endif

  /* Portal-Overrides. 0 heisst durchgaengig "nicht anfassen", damit der
   * sdkconfig-Wert stehen bleibt - siehe Konvention in config.h. */
  if (g_cfg.static_rx_buf)  wcfg.static_rx_buf_num  = g_cfg.static_rx_buf;
  if (g_cfg.dynamic_rx_buf) wcfg.dynamic_rx_buf_num = g_cfg.dynamic_rx_buf;
  if (g_cfg.dynamic_tx_buf) wcfg.dynamic_tx_buf_num = g_cfg.dynamic_tx_buf;
  if (g_cfg.rx_ba_win)      wcfg.rx_ba_win          = g_cfg.rx_ba_win;

  /* KEIN Herunterregeln des BA-Fensters mehr.
   *
   * Hier stand eine Schutzbegrenzung auf min(static_rx, dynamic_rx/2), nach
   * der oft zitierten Kconfig-Regel. Sie war gut gemeint und schaedlich: Bei
   * den Puffern des Rust-Originals (16/32) druckte sie dessen rx_ba_win von
   * 32 auf 16 herunter - also genau den Parameter, der die Empfangs-
   * Aggregation und damit den Download bestimmt. Das Original faehrt diese
   * Kombination seit jeher, die IDF erzwingt die Regel also nicht.
   *
   * Am 2026-08-13 im Log aufgefallen ("rx_ba_win 32 -> 16"), nachdem die
   * Meldung mehrere Messreihen lang unbemerkt mitlief und sie alle verfaelscht
   * hat. Sollte esp_wifi_init() an einem zu grossen Fenster scheitern, faengt
   * das der Fallback darunter ab - das ist der richtige Ort dafuer. */

  /* Gestufter Rueckfall statt Alles-oder-nichts.
   *
   * Vorher wurde bei einem Fehlschlag direkt auf WIFI_INIT_CONFIG_DEFAULT()
   * zurueckgegriffen - das enthaelt aber DIESELBEN Kconfig-Werte, also auch
   * dasselbe rx_ba_win. Scheiterte der Aufruf daran, scheiterte auch der
   * Rueckfall, und das ESP_ERROR_CHECK dahinter machte daraus einen Absturz.
   * Am 2026-08-13 genau so passiert: das Board kam in eine Absturzschleife und
   * wurde vom Bootloader zurueckgerollt.
   *
   * Jetzt wird zuerst der wahrscheinliche Uebeltaeter entschaerft (das
   * BA-Fenster), bevor komplett aufgegeben wird - und jede Stufe sagt im Log,
   * dass sie gegriffen hat. Ein stiller Rueckfall waere hier besonders
   * heimtueckisch, weil er wie eine wirkungslose Einstellung aussieht. */
  /* Fuer die Anzeige merken, was tatsaechlich in den Treiber ging. */
  s_eff_static_rx = wcfg.static_rx_buf_num;
  s_eff_dyn_rx    = wcfg.dynamic_rx_buf_num;
  s_eff_dyn_tx    = wcfg.dynamic_tx_buf_num;
  s_eff_ba_win    = wcfg.rx_ba_win;

  esp_err_t werr = esp_wifi_init(&wcfg);
  if (werr != ESP_OK) {
    printf("[WIFI] init mit rx_ba_win=%d fehlgeschlagen (%s) - reduziere\n",
           wcfg.rx_ba_win, esp_err_to_name(werr));
    uint16_t cap = wcfg.static_rx_buf_num;
    if (wcfg.dynamic_rx_buf_num / 2 < cap) cap = wcfg.dynamic_rx_buf_num / 2;
    if (cap < 2) cap = 2;
    wcfg.rx_ba_win = cap;
    werr = esp_wifi_init(&wcfg);
    if (werr == ESP_OK) {
      printf("[WIFI] init ok mit rx_ba_win=%u\n", (unsigned)cap);
    }
  }
  if (werr != ESP_OK) {
    printf("[WIFI] auch das schlug fehl (%s) - komplette Defaults\n",
           esp_err_to_name(werr));
    wifi_init_config_t fb = WIFI_INIT_CONFIG_DEFAULT();
    fb.rx_ba_win = 6;          /* konservativ, passt zu jeder Pufferzahl */
    ESP_ERROR_CHECK(esp_wifi_init(&fb));
  }

  ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
  ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE));   /* Durchsatz vor Strom */

