doctormord/ESP32-Wifi-Bridge-on-Steroids/src/bridge.cpp
  /* 802.11b abschaltbar: die b-Raten sind langsam und belegen als
   * Basic-Rate unnoetig Sendezeit. Nur sinnvoll, wenn im Netz kein reines
   * b-Geraet mehr haengt - sonst sieht der AP uns evtl. gar nicht mehr. */
  esp_wifi_set_protocol(WIFI_IF_STA,
      g_cfg.no_11b ? (WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N)
                   : (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N));

  /* HT40 verdoppelt die Kanalbreite und damit die Brutto-Datenrate, greift
   * aber nur, wenn der AP auf 2,4 GHz tatsaechlich 40 MHz anbietet - viele
   * tun das aus Koexistenzgruenden nicht. Ohne AP-Unterstuetzung bleibt es
   * folgenlos bei HT20, das ist kein Fehlerfall. */
  esp_err_t bw = esp_wifi_set_bandwidth(
      WIFI_IF_STA, g_cfg.ht40 ? WIFI_BW_HT40 : WIFI_BW_HT20);
  if (bw != ESP_OK) {
    printf("[WIFI] set_bandwidth: %s\n", esp_err_to_name(bw));
  }

  /* Nach den esp_netif-Handlern registrieren - Reihenfolge ist relevant. */
  esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                      &wifi_evt, NULL, NULL);

  struct { const char *ssid; const char *pass; } nets[] = {
    { g_cfg.ssid1, g_cfg.pass1 },
    { g_cfg.ssid2, g_cfg.pass2 },
    { g_cfg.ssid3, g_cfg.pass3 },
  };

  for (size_t i = 0; i < 3; i++) {
    if (nets[i].ssid[0] == '\0') continue;
    printf("[WIFI] Verbinde mit '%s'...\n", nets[i].ssid);

    wifi_config_t wc = {};
    strncpy((char *)wc.sta.ssid,     nets[i].ssid, sizeof(wc.sta.ssid) - 1);
    strncpy((char *)wc.sta.password, nets[i].pass, sizeof(wc.sta.password) - 1);
    wc.sta.pmf_cfg.capable = true;

    /* Den STAERKSTEN Accesspoint dieser SSID nehmen, nicht den erstbesten.
     *
     * Voreingestellt ist WIFI_FAST_SCAN: die IDF verbindet mit dem ersten
     * passenden AP, den sie findet, und bricht die Suche dann ab. In einem
     * Mesh mit mehreren Knoten unter derselben SSID ist das ein Gluecksspiel -
     * und ein ESP32 wechselt danach nicht mehr von selbst.
     *
     * Am 2026-08-15 am Einbauort gemessen: die Bridge hing auf einem Knoten
     * mit -82 dBm, waehrend derselbe SSID-Name auf einem anderen mit -63 dBm
     * verfuegbar war. Folge waren 16 % Paketverlust und statt 8 Mbit nur rund
     * 1 - die Kamera kam nicht durch.
     *
     * ALL_CHANNEL_SCAN kostet beim Verbinden ein paar Sekunden mehr, weil
     * wirklich alle Kanaele abgesucht werden. Das ist einmal pro Start. */
    wc.sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
    wc.sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;

    /* Reihenfolge: set_config, DANN set_mac, DANN start. */
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wc));
    esp_err_t err = esp_wifi_set_mac(WIFI_IF_STA, s_client_mac);
    if (err != ESP_OK) {
      printf("[WIFI] set_mac: %s\n", esp_err_to_name(err));
      return false;
    }

    ESP_ERROR_CHECK(esp_wifi_start());

    /* TX-Power erst NACH esp_wifi_start() - vorher liefert die API
     * ESP_ERR_WIFI_NOT_STARTED. Deshalb steht der Aufruf in der Schleife und
     * nicht weiter oben bei den uebrigen Einstellungen. */
    bridge_apply_live_tuning();

    esp_wifi_connect();

    uint32_t t0 = millis();
    while (!s_wifi_up && (millis() - t0) < WIFI_CONNECT_TIMEOUT_MS) delay(100);
    if (s_wifi_up) {
      /* Verbunden - aber an WELCHEM Standort? Der SSID-Slot verraet es nicht,
       * wenn mehrere Orte dasselbe WLAN heissen. Also die belegten Profile
       * der Reihe nach durchprobieren und ihr Gateway anpingen; begonnen wird
       * mit dem Profil des verbundenen Slots, weil das am wahrscheinlichsten
       * passt. */
#ifndef BRIDGE_MINIMAL
      standort_bestimmen(i);
#endif
      return true;
    }

    printf("[WIFI] '%s' fehlgeschlagen\n", nets[i].ssid);
    esp_wifi_disconnect();
    esp_wifi_stop();
  }
  return false;
}

void bridge_activate(void) {
  esp_eth_update_input_path(s_eth, eth_rx_cb, NULL);
  s_active = true;
  printf("[BRDG] Datenpfad aktiv\n");
}

bool bridge_is_active(void) { return s_active; }
esp_netif_t *bridge_mgmt_netif(void) { return s_mgmt_netif; }
void bridge_get_mgmt_ip(uint8_t out[4]) { memcpy(out, s_mgmt_ip, 4); }

void bridge_get_defaults(bridge_tuning_t *o) {
  o->static_rx    = CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM;
  o->dyn_rx       = CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM;
  o->dyn_tx       = CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM;
  o->ba_win       = CONFIG_ESP_WIFI_RX_BA_WIN;
  o->eth_retries  = ETH_TX_RETRIES_DEF;
  o->wifi_retries = WIFI_TX_RETRIES_DEF;
}

void bridge_get_effective(bridge_tuning_t *o) {
  o->static_rx    = s_eff_static_rx;
  o->dyn_rx       = s_eff_dyn_rx;
  o->dyn_tx       = s_eff_dyn_tx;
  o->ba_win       = s_eff_ba_win;
  o->eth_retries  = s_eth_tx_retries;
  o->wifi_retries = s_wifi_tx_retries;
}

void bridge_get_client_mac(uint8_t out[6]) { memcpy(out, s_client_mac, 6); }

void bridge_set_client_mac(const uint8_t mac[6]) {
  memcpy(s_client_mac, mac, 6);
  s_mac_known = true;
  char t[18]; mac2str(s_client_mac, t);
  printf("[ETH ] Client-MAC aus dem Speicher: %s\n", t);

  /* Denselben Abschluss nachholen, den bridge_sniff_client_mac() nach einem
   * Treffer macht - bei einem Timeout kehrt die dort naemlich vorher zurueck:
   * Sniff-Callback abhaengen und Promiscuous einschalten. Ohne das laefe die
   * Bridge mit installiertem Sniff-Callback und ohne Promiscuous, wuerde also
   * nur Broadcasts durchreichen und praktisch nichts transportieren. */
  esp_eth_update_input_path(s_eth, NULL, NULL);
  bool promisc = true;
  esp_eth_ioctl(s_eth, ETH_CMD_S_PROMISCUOUS, &promisc);
  printf("[ETH ] Promiscuous aktiv\n");
}

/* ===========================================================================
 * Feinabstimmung zur Laufzeit
 * ========================================================================= */

void bridge_apply_live_tuning(void) {
  /* Retry-Zaehler: 0 bedeutet hier NICHT "nie senden", sondern "Default".
   * Ein echtes 0 waere ein stiller Totalausfall des Datenpfads - deshalb
   * faengt der Fallback das ab, statt sich auf die Portal-Pruefung zu
   * verlassen. */
  s_eth_tx_retries  = g_cfg.eth_tx_retries  ? g_cfg.eth_tx_retries  : ETH_TX_RETRIES_DEF;
  s_wifi_tx_retries = g_cfg.wifi_tx_retries ? g_cfg.wifi_tx_retries : WIFI_TX_RETRIES_DEF;

