doctormord/ESP32-Wifi-Bridge-on-Steroids/src/bridge.cpp
  /* Beim ersten Aufruf den Ausgangswert sichern. */
  if (!s_txp_default) {
    int8_t p = 0;
    if (esp_wifi_get_max_tx_power(&p) == ESP_OK && p > 0) s_txp_default = p;
  }

  if (!g_cfg.tx_power) {
    /* 0 heisst "Standard" - und das muss auch aktiv zurueckstellen, nicht
     * bloss nichts tun. */
    if (s_txp_default) {
      esp_wifi_set_max_tx_power(s_txp_default);
      printf("[WIFI] TX-Power auf Standard zurueck (%d.%02d dBm)\n",
             s_txp_default / 4, (s_txp_default % 4) * 25);
    }
  } else {
    esp_err_t e = esp_wifi_set_max_tx_power(g_cfg.tx_power);
    if (e != ESP_OK) {
      printf("[WIFI] set_max_tx_power(%d): %s\n",
             (int)g_cfg.tx_power, esp_err_to_name(e));
    } else {
      /* Den tatsaechlich uebernommenen Wert ausgeben, nicht den gewuenschten:
       * die PHY kennt nur 11 Stufen und rundet ab. */
      int8_t actual = 0;
      if (esp_wifi_get_max_tx_power(&actual) == ESP_OK) {
        printf("[WIFI] TX-Power: %d.%02d dBm (angefordert %d.%02d)\n",
               actual / 4, (actual % 4) * 25,
               g_cfg.tx_power / 4, (g_cfg.tx_power % 4) * 25);
      }
    }
  }

  printf("[BRDG] Retries eth->wifi=%u wifi->eth=%u\n",
         (unsigned)s_eth_tx_retries, (unsigned)s_wifi_tx_retries);
}

int16_t bridge_get_tx_power(void) {
  int8_t p = 0;
  if (esp_wifi_get_max_tx_power(&p) != ESP_OK) return -1;
  return p;
}

uint8_t bridge_get_bandwidth_mhz(void) {
  wifi_bandwidth_t bw;
  if (esp_wifi_get_bandwidth(WIFI_IF_STA, &bw) != ESP_OK) return 0;
  return (bw == WIFI_BW_HT40) ? 40 : 20;
}

void bridge_set_paused(bool paused) {
  /* Nur das Weiterleiten aussetzen, nicht die Treiber stoppen. Die
   * Management-Verbindung (und damit der laufende Upload) bleibt bestehen,
   * weil die Selektivzustellung an lwIP unabhaengig von s_active ist. */
  s_paused = paused;
  printf("[BRDG] Datenpfad %s\n", paused ? "pausiert" : "aktiv");
}

/* ===========================================================================
 * Autotune der Sendewiederholungen
 * ========================================================================= */

static const uint8_t AT_KANDIDATEN[] = { 1, 2, 4, 6, 8, 12, 16, 20 };
#define AT_N            (sizeof(AT_KANDIDATEN) / sizeof(AT_KANDIDATEN[0]))
#define AT_EINSCHWINGEN 4000u    /* Puffer leerlaufen lassen              */
#define AT_MESSDAUER   15000u    /* danach so lange zaehlen               */
#define AT_MIN_PAKETE    400u    /* darunter ist die Messung wertlos      */
#define AT_ZIEL_PROMILLE  10u    /* 0,10 % - erreicht? dann reicht es     */

static autotune_state_t s_at_state = AT_IDLE;
static uint8_t   s_at_idx, s_at_ergebnis;
static uint32_t  s_at_t0, s_at_pkt0, s_at_drop0;
static bool      s_at_messend;
static uint16_t  s_at_verlust[AT_N];
static uint8_t   s_at_alt;               /* Wert vor dem Lauf, fuer Abbruch */

bool bridge_autotune_start(void) {
  if (!s_active || s_at_state == AT_LAEUFT) return false;
  s_at_alt   = s_eth_tx_retries;
  s_at_idx   = 0;
  s_at_state = AT_LAEUFT;
  s_at_messend = false;
  s_at_t0    = millis();
  for (size_t i = 0; i < AT_N; i++) s_at_verlust[i] = 0xFFFF;
  s_eth_tx_retries = AT_KANDIDATEN[0];
  printf("[AUTO] Start - %u Kandidaten, je %u s\n",
         (unsigned)AT_N, (unsigned)((AT_EINSCHWINGEN + AT_MESSDAUER) / 1000));
  return true;
}

autotune_state_t bridge_autotune_state(void)  { return s_at_state; }
uint8_t bridge_autotune_schritt(void)         { return s_at_idx; }
uint8_t bridge_autotune_anzahl(void)          { return AT_N; }
uint8_t bridge_autotune_ergebnis(void)        { return s_at_ergebnis; }
void bridge_autotune_werte(uint8_t *k, uint16_t *v) {
  for (size_t i = 0; i < AT_N; i++) { k[i] = AT_KANDIDATEN[i]; v[i] = s_at_verlust[i]; }
}

/* Wird aus bridge_tick() gerufen, also etwa im Sekundentakt. */
static void autotune_tick(void) {
  if (s_at_state != AT_LAEUFT) return;
  const uint32_t seit = millis() - s_at_t0;

  if (!s_at_messend) {
    if (seit < AT_EINSCHWINGEN) return;
    s_at_pkt0 = s_pkt_e2w; s_at_drop0 = s_drop_e2w;
    s_at_messend = true;
    return;
  }
  if (seit < AT_EINSCHWINGEN + AT_MESSDAUER) return;

  const uint32_t dp = s_pkt_e2w  - s_at_pkt0;
  const uint32_t dd = s_drop_e2w - s_at_drop0;

  if (dp + dd < AT_MIN_PAKETE) {
    /* Ohne nennenswerten Verkehr ist jede Zahl Zufall - lieber ehrlich
     * abbrechen als ein Ergebnis vortaeuschen. */
    printf("[AUTO] Abbruch: nur %u Pakete in %u s - zu wenig Verkehr\n",
           (unsigned)(dp + dd), (unsigned)(AT_MESSDAUER / 1000));
    s_eth_tx_retries = s_at_alt;
    s_at_state = AT_ZU_WENIG_VERKEHR;
    return;
  }

  s_at_verlust[s_at_idx] = (uint16_t)((10000ULL * dd) / (dp + dd));
  printf("[AUTO] Retries %2u -> %u.%02u %% Verlust\n",
         (unsigned)AT_KANDIDATEN[s_at_idx],
         (unsigned)(s_at_verlust[s_at_idx] / 100),
         (unsigned)(s_at_verlust[s_at_idx] % 100));

  if (++s_at_idx < AT_N) {
    s_eth_tx_retries = AT_KANDIDATEN[s_at_idx];
    s_at_messend = false;
    s_at_t0 = millis();
    return;
  }

  /* Auswertung: kleinster Kandidat, der das Ziel erreicht. Verfehlen alle
   * das Ziel, nehmen wir den mit dem geringsten Verlust. */
  uint8_t  gewaehlt = 0;
  uint16_t bestes   = 0xFFFF;
  for (size_t i = 0; i < AT_N; i++) {
    if (s_at_verlust[i] <= AT_ZIEL_PROMILLE) { gewaehlt = AT_KANDIDATEN[i]; break; }
    if (s_at_verlust[i] < bestes) { bestes = s_at_verlust[i]; gewaehlt = AT_KANDIDATEN[i]; }
  }
  s_at_ergebnis = gewaehlt;
  s_eth_tx_retries = gewaehlt;
  g_cfg.eth_tx_retries = gewaehlt;
  cfg_save();
  s_at_state = AT_FERTIG;
  printf("[AUTO] Fertig - gewaehlt: %u (gespeichert)\n", (unsigned)gewaehlt);
}

/* ===========================================================================
 * Watchdog
 *
 * Ausgangspunkt war ein RF-Stoertest (2,4-GHz-Jammer, ca. 1 Minute aktiv):
 * die STA blieb laut Treiber verbunden (wifi_up=true, RSSI unauffaellig),
 * aber die Bruecke stellte kaum noch Pakete zu - Stunden spaeter noch, bis
 * ein manueller Reboot den Zustand geloest hat. Weder RSSI noch wifi_up
 * haetten das erkannt; die einzigen Groessen, die den Einbruch zeigten,
 * waren die Verlustrate im LAN->WLAN-Pfad unter Last und (waere es dazu
 * gekommen) gehaeufte Reassoziierungen. Beides wird hier pro Zeitfenster
 * bewertet, mehrere schlechte Fenster hintereinander loesen einen Neustart
 * aus.
 *
 * Bei zu wenig echtem Verkehr fuer eine Aussage (z.B. Kamera streamt gerade
 * nicht) waere die Bruecke sonst blind genau fuer den Fall, der den ersten
 * Vorfall ausgemacht hat: wifi_up blieb durchgehend true, RSSI unauffaellig,
 * aber Stunden nach dem Stoertest kam kaum noch etwas durch. Deshalb wird in
 * genau diesem Fall aktiv nachgefragt - ein Ping an das WLAN-Gateway ueber
 * das Management-Netif (gateway_erreichbar(), sonst nur beim Boot zur
 * Standorterkennung genutzt). Bewusst NICHT die Kamera selbst: die Bruecke
 * traegt deren geklonte MAC auf dem STA-Interface, ein ICMP vom
 * Management-Stack an die Kamera-IP wuerde also eine ARP-Aufloesung auf die
 * EIGENE MAC ausloesen - ein Rundlauf ueber sich selbst, kein Test von
 * irgendetwas. Das Gateway zu erreichen, durchlaeuft dagegen denselben
 * lwIP/Netif/Funk-Pfad, ueber den auch das Management-HTTP laeuft, das beim
 * Vorfall tatsaechlich unerreichbar war - ein brauchbarer Stellvertreter,
 * ohne den fragilen Rohframe-Pfad in eth_rx_cb/wifi_rx_cb anzufassen.
 * ========================================================================= */

#define WD_WINDOW_MS           20000u  /* Messfenster. War anfangs 10s - zu
                                        * hektisch fuer eine kurze Schwankung,
                                        * siehe 2026-09-04 in history.md.     */
#define WD_MIN_PAKETE             200u  /* darunter keine Aussage aus Zaehlern moeglich */
#define WD_VERLUST_PROMILLE      150u  /* 15% Verlust im Fenster = "schlecht" */
#define WD_DISC_JE_FENSTER          4  /* so viele Reconnects im Fenster = "schlecht" */
#define WD_SCHLECHTE_FENSTER        3  /* so oft hintereinander -> naechste
                                        * Eskalationsstufe (gilt fuer beide) */
#define WD_PROBE_BUDGET_MS      1200u  /* Obergrenze fuer die Gateway-Sonde -
                                        * blockiert bridge_tick() kurzzeitig,
                                        * siehe Kommentar dort                */

