doctormord/ESP32-Wifi-Bridge-on-Steroids/src/bridge.cpp
/*
 * Zweistufige Eskalation statt direktem esp_restart().
 *
 * Ein voller Neustart reisst den Ethernet-MAC/PHY kurz runter - das bringt
 * die angeschlossene Kamera fuer die Dauer des Boots vom Netz, und je nach
 * Kamera-Firmware braucht sie danach spuerbar Zeit, um sich zu erholen (am
 * 2026-09-04 nach einem Portal-Neustart ca. 3 Minuten). Und wichtiger: ein
 * Neustart repariert keine schlechte Funkumgebung - wenn die Stoerung noch
 * da ist, scheitert der neue Verbindungsversuch nach dem Reboot genauso wie
 * ein einfacher Reconnect. Ein Reboot ist also nur dann die richtige
 * Reaktion, wenn der WLAN-Treiber selbst haengt (wie nach dem Jammer-Test:
 * die Umgebung war zu dem Zeitpunkt schon wieder gut, nur der Treiber nicht) -
 * und genau DAS laesst sich mit einem reinen esp_wifi_disconnect() pruefen,
 * ohne Ethernet/Kamera ueberhaupt anzufassen.
 *
 * Stufe 1 (WD_STUFE_RECONNECT): nur trennen. wifi_evt() verbindet bei
 * WIFI_EVENT_STA_DISCONNECTED automatisch neu, solange s_active gilt - kein
 * zusaetzlicher esp_wifi_connect() noetig, das uebernimmt bereits bestehende
 * Logik. Zaehlt NICHT als Fehlstart (siehe bridge_consume_planned_restart()),
 * weil dabei gar kein Neustart passiert.
 *
 * Stufe 2 (Ultima Ratio): erst wenn Stufe 1 nicht half. Dann voller Neustart -
 * aber ueber abort() statt esp_restart(), damit ein Coredump entsteht: der
 * naechste Boot soll nachvollziehbar sein (Backtrace zeigt exakt diese
 * Codestelle, Grund steht zusaetzlich in bridge_get_stats()->wd_last_reason,
 * ueberlebt den Neustart im RTC-Speicher). Zaehlt bewusst trotzdem NICHT als
 * Fehlstart - das Geraet ist ja sauber gebootet und gelaufen.
 */
typedef enum {
  WD_REASON_NONE        = 0,
  WD_REASON_VERLUST     = 1,   /* Verlustquote ueber der Schwelle */
  WD_REASON_DISCONNECTS = 2,   /* zu viele Reconnects im Fenster */
  WD_REASON_SONDE       = 3,   /* Gateway-Sonde fehlgeschlagen */
} wd_reason_t;

/* Fehlstart-Ausnahme: einmalig auswertbar, wird beim Lesen geloescht - siehe
 * bridge_consume_planned_restart(). Analog zu main.cpp's PORTAL_MAGIC. */
#define WD_RESTART_MAGIC 0x57445254u  /* "WDRT" */
RTC_NOINIT_ATTR static uint32_t s_wd_restart_magic;

/* Anzeige-Grund: NICHT einmalig, bleibt fuer /api/status bzw. MQTT stehen,
 * bis der naechste Watchdog-Neustart ihn ueberschreibt. Eigenes Magic-Wort,
 * weil RTC-Speicher nach einem echten Kaltstart undefiniert ist. */
#define WD_REASON_MAGIC  0x57445253u  /* "WDRS" */
RTC_NOINIT_ATTR static uint32_t s_wd_reason_magic;
RTC_NOINIT_ATTR static uint8_t  s_wd_reason;

void bridge_mark_planned_restart(uint8_t reason) {
  s_wd_restart_magic = WD_RESTART_MAGIC;
  s_wd_reason_magic  = WD_REASON_MAGIC;
  s_wd_reason        = reason;
}

bool bridge_consume_planned_restart(void) {
  const bool planned = (s_wd_restart_magic == WD_RESTART_MAGIC);
  s_wd_restart_magic = 0;
  return planned;
}

static uint32_t s_wd_t0 = 0, s_wd_pkt0 = 0, s_wd_drop0 = 0, s_wd_disc0 = 0;
static uint8_t  s_wd_bad = 0;
static uint8_t  s_wd_probe = 0;   /* 0=nicht noetig/aus, 1=ok, 2=fehlgeschlagen -
                                   * fuer /api/status, siehe BridgeStats.wd_probe */
static uint8_t  s_wd_stage = 0;   /* 0=normal, 1=nach Reconnect-Versuch (Stufe 1) */
static uint32_t s_wd_reconnects = 0;  /* seit Boot, fuer /api/status/MQTT */

/* Aktuell auf dem Management-Netif eingetragenes Gateway auslesen - nicht
 * erneut aus g_cfg/Profilwahl ableiten (drei moegliche Profile), sondern
 * direkt beim Netif nachfragen, das nach mgmt_apply_ip() die verbindliche
 * Quelle ist. */
static bool wd_gateway_holen(uint8_t gw[4]) {
  if (!s_mgmt_netif) return false;
  esp_netif_ip_info_t ip = {};
  if (esp_netif_get_ip_info(s_mgmt_netif, &ip) != ESP_OK) return false;
  memcpy(gw, &ip.gw.addr, 4);
  return gw[0] || gw[1] || gw[2] || gw[3];
}

static void watchdog_tick(void) {
  /* Waehrend OTA (s_paused) oder ausserhalb des Bridge-Betriebs keine
   * Bewertung - ein Neustart mitten im Firmware-Flash waere fatal, und ohne
   * aktiven Datenpfad sind die Zaehler ohnehin bedeutungslos. */
  if (!g_cfg.wd_enable || !s_active || s_paused) {
    s_wd_bad = 0; s_wd_t0 = 0; s_wd_probe = 0; s_wd_stage = 0;
    return;
  }

  const uint32_t now = millis();
  if (s_wd_t0 == 0) {
    s_wd_t0 = now; s_wd_pkt0 = s_pkt_e2w; s_wd_drop0 = s_drop_e2w;
    s_wd_disc0 = s_wifi_disc_count;
    return;
  }
  if (now - s_wd_t0 < WD_WINDOW_MS) return;

  const uint32_t dp    = s_pkt_e2w - s_wd_pkt0;
  const uint32_t dd    = s_drop_e2w - s_wd_drop0;
  const uint32_t ddisc = s_wifi_disc_count - s_wd_disc0;
  s_wd_t0 = now; s_wd_pkt0 = s_pkt_e2w; s_wd_drop0 = s_drop_e2w;
  s_wd_disc0 = s_wifi_disc_count;

  bool schlecht = false;
  uint8_t grund = WD_REASON_NONE;

  if (dp + dd >= WD_MIN_PAKETE) {
    /* Genug echter Verkehr - die Verlustquote entscheidet, keine Sonde
     * noetig (spart Luftzeit waehrend eines laufenden Streams). */
    s_wd_probe = 0;
    const uint32_t promille = (1000ULL * dd) / (dp + dd);
    if (promille >= WD_VERLUST_PROMILLE) { schlecht = true; grund = WD_REASON_VERLUST; }
  } else {
    uint8_t gw[4];
    if (!wd_gateway_holen(gw)) {
      s_wd_probe = 0;   /* kein Gateway bekannt - keine Aussage moeglich */
    } else if (gateway_erreichbar(gw, WD_PROBE_BUDGET_MS)) {
      s_wd_probe = 1;
    } else {
      s_wd_probe = 2;
      schlecht = true; grund = WD_REASON_SONDE;
    }
  }
  /* Reconnects gehen vor - wenn beides zutrifft, ist das haeufigere
   * Neuassoziieren das aussagekraeftigere Symptom. */
  if (ddisc >= WD_DISC_JE_FENSTER) { schlecht = true; grund = WD_REASON_DISCONNECTS; }

  s_wd_bad = schlecht ? (uint8_t)(s_wd_bad + 1) : 0;
  printf("[WD  ] Stufe %u, Fenster: %u Pakete, %u Verlust, %u Reconnects, Sonde=%u -> %s (%u/%u)\n",
         (unsigned)s_wd_stage, (unsigned)(dp + dd), (unsigned)dd, (unsigned)ddisc,
         (unsigned)s_wd_probe, schlecht ? "schlecht" : "ok",
         (unsigned)s_wd_bad, (unsigned)WD_SCHLECHTE_FENSTER);

  if (!schlecht) {
    /* Erholt - eine eventuell laufende Eskalation ist erledigt. */
    s_wd_stage = 0;
    return;
  }
  if (s_wd_bad < WD_SCHLECHTE_FENSTER) return;

