doctormord/ESP32-Wifi-Bridge-on-Steroids/src/bridge.cpp
  if (s_wd_stage == 0) {
    /* Eskalationsstufe 1: nur WLAN trennen. wifi_evt() verbindet bei
     * WIFI_EVENT_STA_DISCONNECTED automatisch neu (s_active gilt hier immer),
     * ein zusaetzlicher esp_wifi_connect() waere doppelt gemoppelt. Ethernet
     * bleibt komplett unberuehrt - die Kamera merkt architektonisch nichts. */
    printf("[WD  ] %u schlechte Fenster - trenne WLAN fuer Neuverbindung (Stufe 1)\n",
           (unsigned)s_wd_bad);
    esp_wifi_disconnect();
    s_wd_reconnects++;
    s_wd_stage = 1;
    s_wd_bad = 0;
    s_wd_t0  = 0;   /* naechstes Fenster startet frisch - der Reconnect
                     * selbst braucht ein paar Sekunden, die sollen dem
                     * aktuell laufenden Fenster nicht angelastet werden. */
    return;
  }

  /* Stufe 1 hat nicht geholfen - letzte Eskalationsstufe. abort() statt
   * esp_restart(), damit ein Coredump entsteht: der naechste Boot soll
   * nachvollziehbar sein, nicht nur "es startete neu". */
  printf("[WD  ] Reconnect brachte keine Besserung - erzwinge Neustart mit Coredump (Grund %u)\n",
         (unsigned)grund);
  bridge_mark_planned_restart(grund);
  delay(200);   /* Log-Zeile noch rausschreiben lassen */
  abort();
}

/* ===========================================================================
 * Statistik
 * ========================================================================= */

void bridge_tick(void) {
  autotune_tick();
  watchdog_tick();

  static uint32_t last = 0;
  static uint64_t le = 0, lw = 0;

  const uint32_t now = millis();
  if (now - last < 1000) return;
  const uint32_t dt = now - last ? now - last : 1;
  last = now;

  const uint64_t e = s_by_e2w, w = s_by_w2e;
  s_kbps_e2w = (uint32_t)(((e - le) * 8ULL) / dt);
  s_kbps_w2e = (uint32_t)(((w - lw) * 8ULL) / dt);
  le = e; lw = w;
}

void bridge_get_stats(BridgeStats *o) {
  memset(o, 0, sizeof(*o));
  o->pkt_eth2wifi  = s_pkt_e2w;
  o->pkt_wifi2eth  = s_pkt_w2e;
  o->drop_eth2wifi = s_drop_e2w;
  o->drop_wifi2eth = s_drop_w2e;
  o->kbps_eth2wifi = s_kbps_e2w;
  o->kbps_wifi2eth = s_kbps_w2e;
  o->wifi_disc_count = s_wifi_disc_count;
  o->wd_probe      = s_wd_probe;
  o->wd_reconnects = s_wd_reconnects;
  o->wd_last_reason = (s_wd_reason_magic == WD_REASON_MAGIC) ? s_wd_reason : 0;
  o->eth_link      = s_eth_link;
  o->wifi_up       = s_wifi_up;
  strcpy(o->bssid, s_bssid_str);

  if (s_mac_known) mac2str(s_client_mac, o->client_mac);
  else             strcpy(o->client_mac, "-");

  strncpy(o->client_name, s_client_name[0] ? s_client_name : "-",
          sizeof(o->client_name) - 1);
  o->client_name[sizeof(o->client_name) - 1] = '\0';

  if (s_client_ip[0] | s_client_ip[1] | s_client_ip[2] | s_client_ip[3])
    sprintf(o->client_ip, "%u.%u.%u.%u",
            s_client_ip[0], s_client_ip[1], s_client_ip[2], s_client_ip[3]);
  else
    strcpy(o->client_ip, "-");

  wifi_ap_record_t ap;
  o->ssid[0] = '\0';
  if (s_wifi_up && esp_wifi_sta_get_ap_info(&ap) == ESP_OK) {
    o->rssi    = ap.rssi;
    o->channel = ap.primary;
    /* Bei mehreren konfigurierten WLANs war bisher nirgends ablesbar, ueber
     * welches die Bridge tatsaechlich haengt - die BSSID allein sagt das
     * niemandem. */
    strncpy(o->ssid, (const char *)ap.ssid, sizeof(o->ssid) - 1);
    o->ssid[sizeof(o->ssid) - 1] = '\0';
  }
}
